print("โปรแกรมแปลงสกุลเงินในประเทศอาเซียน\n(ข้อมูล ณ วันที่ 10 พ.ย. 2567)")
def cal() :
        print("เลือกสกุลเงินที่จะเปลี่ยน")
        print("1.บาท (ประเทศไทย) \n 2.ริงกิต (มาเลเซีย) \n 3.ดอลล่าร์สิงคโปร์ (สิงคโปร์) \n 4.กีบ (ลาว) \n 5.รูเปียห์ (อินโดนีเซีย) \n 6.เปโซ (ฟิลิปปินส์) \n 7.จ๊าด(เมียนมาร์) \n 8.ดอลล่าร์บรูไน (บรูไน) \n 9.ด่ง (เวียดนาม) \n 10.เรียล (กัมพูชา)")
        bf=int(input("เลือกสกุลเงินตั้งต้น(1-10) : "))
        m=float(input("ป้อนจำนวนเงิน(บาท) : "))

        if bf==1 :
            tb=m
            print(m,"บาท","=",tb)
        elif bf==2 :
            tb=m*0.1281
            print(m,"บาท","=",tb)
        elif bf==3 :
            tb=m*0.0384
            print(m,"บาท","=",tb)
        elif bf==4 :
            tb=m*627.1
            print(m,"บาท","=",tb)
        elif bf==5 :
            tb=m*453.4
            print(m,"บาท","=",tb)
        elif bf==6 :
            tb=m*1.68
            print(m,"บาท","=",tb)
        elif bf==7 :
            tb=m*60.1443
            print(m,"บาท","=",tb)
        elif bf==8 :
            tb=m*0.03845
            print(m,"บาท","=",tb)
        elif bf==9 :
            tb=m*726.2
            print(m,"บาท","=",tb)
        elif bf==10 :
            tb=m*11115.8
            print(m,"บาท","=",tb)
        else :
            print("ข้อมูลผิดพลาด")
            cal()
cal()